///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, Intel Corporation
// Permission is hereby granted, free of charge, to any person obtaining a   copy of this software and associated
// documentation files (the "Software"), to deal in the Software without restriction, including without limitation 
// the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to
// permit persons to whom the Software is    furnished to do so, subject to the following conditions:
// The above copyright notice and this permission notice shall be included in all copies or substantial portions of 
// the Software.
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO
// THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A    PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE 
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, 
// TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#pragma once

#include <stdint.h>
#include <array>
#include <vector>
#include <string>
#include <stdio.h>
#include <bitset>
#include <map>

#define CPUID(registers, function) asm volatile ("cpuid" : "=a" (registers[0]), "=b" (registers[1]), "=c" (registers[2]), "=d" (registers[3]) : "a" (function), "c" (0));
#define CPUIDEX(registers, function, extFunction) asm volatile ("cpuid" : "=a" (registers[0]), "=b" (registers[1]), "=c" (registers[2]), "=d" (registers[3]) : "a" (function), "c" (extFunction));
#define XGETBV(xcrReg) (0) // TODO
#endif

// Enables/Disables Hybrid Detect
#define ENABLE_HYBRID_DETECT

// Tells the application to treat the target system as a heterogeneous software proxy.
//#define ENABLE_SOFTWARE_PROXY	

// Enables/Disables Run On API
#define ENABLE_RUNON

// Enables/Disables ThreadPriority Based on Core-Type
//#define ENABLE_RUNON_PRIORITY

// Enables/Disables SetThreadInformation Memory Priority Based on Core-Type
//#define ENABLE_RUNON_MEMORY_PRIORITY

// Enables/Disables SetThreadInformation Execution Speed based on Core-Type
//#define ENABLE_RUNON_EXECUTION_SPEED

// Enables CPU-Sets and Disables ThreadAffinityMasks
#define ENABLE_CPU_SETS

// No current CPUs have ISA support that varies between cores
#ifndef ENABLE_PER_LOGICAL_CPUID_ISA_DETECTION
#define ENABLE_PER_LOGICAL_CPUID_ISA_DETECTION 1 // Default to enabled for backward compatibility
#endif

// Simple conversion from an ordinal, n, to a set bit at position n
#define IndexToMask(n)  (1UL << n)

// Macros to store values for CPUID register ordinals
#define CPUID_EAX								0
#define CPUID_EBX								1
#define CPUID_ECX								2
#define CPUID_EDX								3

#define LEAF_CPUID_BASIC						0x00        // Basic CPUID Information
#define LEAF_THERMAL_POWER						0x06        // Thermal and Power Management Leaf
#define LEAF_EXTENDED_FEATURE_FLAGS				0x07        // Structured Extended Feature Flags Enumeration Leaf (Output depends on ECX input value)
#define LEAF_EXTENDED_STATE						0x0D        // Processor Extended State Enumeration Main Leaf (EAX = 0DH, ECX = 0)
#define LEAF_FREQUENCY_INFORMATION				0x16        // Processor Frequency Information Leaf  function 0x16 only works on Skylake or newer.
#define LEAF_HYBRID_INFORMATION					0x1A        // Hybrid Information Sub - leaf(EAX = 1AH, ECX = 0)
#define LEAF_EXTENDED_INFORMATION_0				0x80000000  // Extended Function CPUID Information
#define LEAF_EXTENDED_INFORMATION_1				0x80000001  // Extended Function CPUID Information
#define LEAF_EXTENDED_BRAND_STRING_1			0x80000002  // Extended Function CPUID Information
#define LEAF_EXTENDED_BRAND_STRING_2			0x80000003  // Extended Function CPUID Information
#define LEAF_EXTENDED_BRAND_STRING_3			0x80000004  // Extended Function CPUID Information
#define LEAF_EXTENDED_INFORMATION_5				0x80000005  // Extended Function CPUID Information
#define LEAF_EXTENDED_INFORMATION_6				0x80000006  // Extended Function CPUID Information
#define LEAF_EXTENDED_INFORMATION_7				0x80000007  // Extended Function CPUID Information
#define LEAF_EXTENDED_INFORMATION_8				0x80000008  // Extended Function CPUID Information

enum CoreTypes
{
	ANY = -1,
	NONE = 0x00,
	RESERVED0 = 0x10,
	INTEL_ATOM = 0x20,
	RESERVED1 = 0x30,
	INTEL_CORE = 0x40,
};

// Struct to store information for each Cache.
typedef struct _CACHE_INFO
{
	unsigned                            group = 0;
	std::bitset<64>						processorMask = 0;
	unsigned							level = 0;
	unsigned							size = 0;
	unsigned							lineSize = 0;
	unsigned							type = 0; // PROCESSOR_CACHE_TYPE
	unsigned							associativity = 0;
} CACHE_INFO, * PCACHE_INFO;

// Struct to store Power information for a logical processor.
typedef struct _LOGICAL_PROCESSOR_POWER_INFORMATION {
	ULONG								number = 0;
	ULONG								maxMhz = 0;
	ULONG								currentMhz = 0;
	ULONG								mhzLimit = 0;
	ULONG								maxIdleState = 0;
	ULONG								currentIdleState = 0;
} LOGICAL_PROCESSOR_POWER_INFORMATION, * PLOGICAL_PROCESSOR_POWER_INFORMATION;

// Struct to store Power information for a logical processor.
typedef struct _LOGICAL_PROCESSOR_INFO
{
	unsigned							id = 0;
	unsigned							group = 0;
	unsigned							node = 0;
	unsigned							coreIndex = 0;
	unsigned							logicalProcessorIndex = 0;
	std::bitset<64>						processorMask = 0;
	unsigned							baseFrequency = 0;
	unsigned							currentFrequency = 0;
	unsigned							maximumFrequency = 0;
	unsigned							busFrequency = 0;
#if ENABLE_PER_LOGICAL_CPUID_ISA_DETECTION
	unsigned							SSE : 1;
	unsigned							AVX : 1;
	unsigned							AVX2 : 1;
	unsigned							AVX512 : 1;
	unsigned							AVX512F : 1;
	unsigned							AVX512DQ : 1;
	unsigned							AVX512PF : 1;
	unsigned							AVX512ER : 1;
	unsigned							AVX512CD : 1;
	unsigned							AVX512BW : 1;
	unsigned							AVX512VL : 1;
	unsigned							AVX512_IFMA : 1;
	unsigned							AVX512_VBMI : 1;
	unsigned							AVX512_VBMI2 : 1;
	unsigned							AVX512_VNNI : 1;
	unsigned							AVX512_BITALG : 1;
	unsigned							AVX512_VPOPCNTDQ : 1;
	unsigned							AVX512_4VNNIW : 1;
	unsigned							AVX512_4FMAPS : 1;
	unsigned							AVX512_VP2INTERSECT : 1;
	unsigned							SGX : 1;
	unsigned							SHA : 1;
#endif // ENABLE_PER_LOGICAL_CPUID_ISA_DETECTION
	unsigned							parked : 1;
	unsigned							allocated : 1;
	unsigned							allocatedToTargetProcess : 1;
	unsigned							realTime : 1;
	ULONG64								allocationTag = 0;
	unsigned							efficiencyClass = 0;
	unsigned							schedulingClass = 0;
	CoreTypes							coreType = CoreTypes::NONE;
	LOGICAL_PROCESSOR_POWER_INFORMATION powerInformation;
} LOGICAL_PROCESSOR_INFO, * PLOGICAL_PROCESSOR_INFO;

typedef struct _GROUP_INFO
{
	unsigned							activeGroupCount = 0;
	unsigned							maximumGroupCount = 0;
	unsigned							activeProcessorCount = 0;
	unsigned							maximumProcessorCount = 0;
	ULONG64								activeProcessorMask = 0;
}	GROUP_INFO, * PGROUP_INFO;

typedef struct _NUMA_NODE_INFO
{
	unsigned							nodeNumber = 0;
	unsigned							group = 0;
	ULONG64								mask = 0;
}	NUMA_NODE_INFO, * PNUMA_NODE_INFO;

// Feature flags
struct FeatureFlags
{
	// CPUID.1:ECX
	unsigned SSE3 : 1;		// 0, All x64 CPUs have at least SSE3
	unsigned PCLMULQDQ : 1; // 1
	unsigned SSSE3 : 1;		// 9
	unsigned FMA : 1;		// 12, See 14.5.3 - On top of AVX
	unsigned SSE4_1 : 1;	// 19
	unsigned SSE4_2 : 1;	// 20
	unsigned AES : 1;		// 25
	unsigned XSAVE : 1;		// 26, Safe to call xgetbv with ecx=0
	unsigned OSXSAVE : 1;	// 27
	unsigned AVX : 1;		// 28. See 14.3
	unsigned F16C : 1;		// 29
	unsigned RDRAND : 1;	// 30

	//AVX2: CPUID.(EAX=07H, ECX=0H):EBX.AVX2[bit 5]=1
	unsigned AVX2 : 1; // Check OSXSAVE and AVX and OS_Supports_YMM
	//Verify both CPUID.0x7.0:EBX.AVX512F[bit 16] = 1
	unsigned AVX512F : 1;	// 16
	unsigned AVX512DQ : 1;	// 17
	unsigned AVX512_IFMA : 1; // 21
	unsigned AVX512CD : 1;	// 28
	unsigned AVX512BW : 1;	// 30
	unsigned AVX512VL : 1;	// 31


	// Derived
	unsigned OS_Supports_YMM : 1;
	unsigned OS_Supports_ZMM : 1;

	bool AVX_Supported() const
	{
		return AVX && OS_Supports_YMM;
	}
	bool F16C_Supported() const
	{
		return AVX_Supported() && F16C;
	}
	bool AVX2_Supported() const
	{
		return AVX_Supported() && AVX2;
	}
	bool AVX512_State_Supported() const
	{
		return OS_Supports_ZMM;
	}
	// Initial set of AVX512 features supported on SkylakeX
	bool AVX512_SKX_Supported() const
	{
		return OS_Supports_ZMM && AVX512F && AVX512VL && AVX512BW && AVX512DQ && AVX512CD;
	}

};

// Struct to store Processor information
typedef struct _PROCESSOR_INFO
{
	char								vendorID[13];
	char								brandString[64];
	unsigned							numGroups = 0;
	unsigned							numNUMANodes = 0;
	unsigned							numProcessorPackages = 0;
	unsigned							numPhysicalCores = 0;
	unsigned							numLogicalCores = 0;
	unsigned							numL1Caches = 0;
	unsigned							numL2Caches = 0;
	unsigned							numL3Caches = 0;
